#ifndef Z64PLAYER_H
#define Z64PLAYER_H

#include "z64actor.h"
#include "alignment.h"
#include "soh/Enhancements/item-tables/ItemTableTypes.h"

struct Player;

extern GetItemEntry sGetItemTable[195];

typedef enum {
    /* 0 */ PLAYER_SWORD_NONE,
    /* 1 */ PLAYER_SWORD_KOKIRI,
    /* 2 */ PLAYER_SWORD_MASTER,
    /* 3 */ PLAYER_SWORD_BIGGORON,
    /* 4 */ PLAYER_SWORD_MAX
} PlayerSword;

typedef enum {
    /* 0x00 */ PLAYER_SHIELD_NONE,
    /* 0x01 */ PLAYER_SHIELD_DEKU,
    /* 0x02 */ PLAYER_SHIELD_HYLIAN,
    /* 0x03 */ PLAYER_SHIELD_MIRROR,
    /* 0x04 */ PLAYER_SHIELD_MAX
} PlayerShield;

typedef enum {
    /* 0x00 */ PLAYER_TUNIC_KOKIRI,
    /* 0x01 */ PLAYER_TUNIC_GORON,
    /* 0x02 */ PLAYER_TUNIC_ZORA,
    /* 0x03 */ PLAYER_TUNIC_MAX
} PlayerTunic;

typedef enum {
    /* 0x00 */ PLAYER_BOOTS_KOKIRI,
    /* 0x01 */ PLAYER_BOOTS_IRON,
    /* 0x02 */ PLAYER_BOOTS_HOVER,
    /* Values below are only relevant when setting regs in Player_SetBootData */
    /* 0x03 */ PLAYER_BOOTS_INDOOR,
    /* 0x04 */ PLAYER_BOOTS_IRON_UNDERWATER,
    /* 0x05 */ PLAYER_BOOTS_KOKIRI_CHILD,
    /* 0x06 */ PLAYER_BOOTS_MAX
} PlayerBoots;

typedef enum {
    /* 0x00 */ PLAYER_STR_NONE,
    /* 0x01 */ PLAYER_STR_BRACELET,
    /* 0x02 */ PLAYER_STR_SILVER_G,
    /* 0x03 */ PLAYER_STR_GOLD_G,
    /* 0x04 */ PLAYER_STR_MAX
} PlayerStrength;

typedef enum {
    /* 0x00 */ PLAYER_MASK_NONE,
    /* 0x01 */ PLAYER_MASK_KEATON,
    /* 0x02 */ PLAYER_MASK_SKULL,
    /* 0x03 */ PLAYER_MASK_SPOOKY,

    /* 0x14 */ PLAYER_ANIMGROUP_START_DEFENDING,
    /* 0x15 */ PLAYER_ANIMGROUP_DEFENDING,
    /* 0x16 */ PLAYER_ANIMGROUP_END_DEFENDING,
    /* 0x17 */ PLAYER_ANIMGROUP_END_SIDEWALKING,
    /* 0x18 */ PLAYER_ANIMGROUP_SIDEWALKING_LEFT,
    /* 0x19 */ PLAYER_ANIMGROUP_SIDEWALKING_RIGHT,
    /* 0x1A */ PLAYER_ANIMGROUP_SHUFFLE_TURN,
    /* 0x1B */ PLAYER_ANIMGROUP_END_FIGHTING_LEFT_OF_ENEMY,
    /* 0x1C */ PLAYER_ANIMGROUP_END_FIGHTING_RIGHT_OF_ENEMY,
    /* 0x1D */ PLAYER_ANIMGROUP_THROWING_OBJECT,
    /* 0x1E */ PLAYER_ANIMGROUP_PUTTING_DOWN_OBJECT,
    /* 0x1F */ PLAYER_ANIMGROUP_BACKWALKING,
    /* 0x20 */ PLAYER_ANIMGROUP_START_CHECKING_OR_SPEAKING,
    /* 0x21 */ PLAYER_ANIMGROUP_CHECKING_OR_SPEAKING,
    /* 0x22 */ PLAYER_ANIMGROUP_END_CHECKING_OR_SPEAKING,
    /* 0x23 */ PLAYER_ANIMGROUP_END_PULL_OBJECT,
    /* 0x24 */ PLAYER_ANIMGROUP_PULL_OBJECT,
    /* 0x25 */ PLAYER_ANIMGROUP_PUSH_OBJECT,
    /* 0x26 */ PLAYER_ANIMGROUP_KNOCKED_FROM_CLIMBING,
    /* 0x27 */ PLAYER_ANIMGROUP_HANGING_FROM_LEDGE,
    /* 0x28 */ PLAYER_ANIMGROUP_CLIMBING_IDLE,
    /* 0x29 */ PLAYER_ANIMGROUP_CLIMBING,
    /* 0x2A */ PLAYER_ANIMGROUP_SLIDING_DOWN_SLOPE,
    /* 0x2B */ PLAYER_ANIMGROUP_END_SLIDING_DOWN_SLOPE,
    /* 0x2C */ PLAYER_ANIMGROUP_RELAX,
    /* 0x2D */ PLAYER_ANIMGROUP_MAX
} PlayerAnimGroup;

#define PLAYER_ANIMSFXFLAGS_0 (1 << 11) // 0x0800
#define PLAYER_ANIMSFXFLAGS_1 (1 << 12) // 0x1000
#define PLAYER_ANIMSFXFLAGS_2 (1 << 13) // 0x2000
#define PLAYER_ANIMSFXFLAGS_3 (1 << 14) // 0x4000

#define PLAYER_LOOKFLAGS_OVERRIDE_FOCUS_ROT_X (1 << 0)     // 0x00001
#define PLAYER_LOOKFLAGS_OVERRIDE_FOCUS_ROT_Y (1 << 1)     // 0x00002
#define PLAYER_LOOKFLAGS_OVERRIDE_FOCUS_ROT_Z (1 << 2)     // 0x00004
#define PLAYER_LOOKFLAGS_OVERRIDE_HEAD_ROT_X (1 << 3)      // 0x00008
#define PLAYER_LOOKFLAGS_OVERRIDE_HEAD_ROT_Y (1 << 4)      // 0x00010
#define PLAYER_LOOKFLAGS_OVERRIDE_HEAD_ROT_Z (1 << 5)      // 0x00020
#define PLAYER_LOOKFLAGS_OVERRIDE_UPPERBODY_ROT_X (1 << 6) // 0x00040
#define PLAYER_LOOKFLAGS_OVERRIDE_UPPERBODY_ROT_Y (1 << 7) // 0x00080
#define PLAYER_LOOKFLAGS_OVERRIDE_UPPERBODY_ROT_Z (1 << 8) // 0x00100

#define PLAYER_ANIMMOVEFLAGS_UPDATE_XZ (1 << 0)
#define PLAYER_ANIMMOVEFLAGS_UPDATE_Y (1 << 1)
#define PLAYER_ANIMMOVEFLAGS_NO_AGE_Y_TRANSLATION_SCALE (1 << 2)
#define PLAYER_ANIMMOVEFLAGS_KEEP_ANIM_Y_TRANSLATION (1 << 3)
#define PLAYER_ANIMMOVEFLAGS_NO_MOVE (1 << 4)
#define PLAYER_ANIMMOVEFLAGS_5 (1 << 5)
#define PLAYER_ANIMMOVEFLAGS_6 (1 << 6)
#define PLAYER_ANIMMOVEFLAGS_7 (1 << 7)
#define PLAYER_ANIMMOVEFLAGS_UPDATE_PREV_TRANSL_ROT (1 << 8)
#define PLAYER_ANIMMOVEFLAGS_UPDATE_PREV_TRANSL_ROT_APPLY_AGE_SCALE (1 << 9)

#define PLAYER_BOTTLEDRINKEFFECT_HEAL_STRONG (1 << 0)
#define PLAYER_BOTTLEDRINKEFFECT_FILL_MAGIC (1 << 1)
#define PLAYER_BOTTLEDRINKEFFECT_HEAL_WEAK (1 << 2)

#define LIMB_BUF_COUNT(limbCount) ((ALIGN16((limbCount) * sizeof(Vec3s)) + sizeof(Vec3s) - 1) / sizeof(Vec3s))
#define PLAYER_LIMB_BUF_COUNT LIMB_BUF_COUNT(PLAYER_LIMB_MAX)

typedef struct {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ Vec3s unk_44;
    /* 0x4A */ Vec3s unk_4A[4];
    /* 0x62 */ Vec3s unk_62[4];
    /* 0x7A */ Vec3s unk_7A[2];
    /* 0x86 */ Vec3s unk_86[2];
    /* 0x92 */ u16 unk_92;
    /* 0x94 */ u16 unk_94;
    /* 0x98 */ LinkAnimationHeader* unk_98;
    /* 0x9C */ LinkAnimationHeader* unk_9C;
    /* 0xA0 */ LinkAnimationHeader* unk_A0;
    /* 0xA4 */ LinkAnimationHeader* unk_A4;
    /* 0xA8 */ LinkAnimationHeader* unk_A8;
    /* 0xAC */ LinkAnimationHeader* unk_AC[4];
    /* 0xBC */ LinkAnimationHeader* unk_BC[2];
    /* 0xC4 */ LinkAnimationHeader* unk_C4[2];
    /* 0xCC */ LinkAnimationHeader* unk_CC[2];
} PlayerAgeProperties; // size = 0xD4

typedef struct {
    /* 0x00 */ s32 active;
    /* 0x04 */ Vec3f tip;
    /* 0x10 */ Vec3f base;
} WeaponInfo; // size = 0x1C

// #region SOH [General]
// Supporting pendingFlag
// Upstream TODO: Rename these to be more obviously SoH specific
typedef enum {
    FLAG_NONE,
    FLAG_SCENE_SWITCH,
    FLAG_SCENE_TREASURE,
    FLAG_SCENE_CLEAR,
    FLAG_SCENE_COLLECTIBLE,
    FLAG_EVENT_CHECK_INF,
    FLAG_ITEM_GET_INF,
    FLAG_INF_TABLE,
    FLAG_EVENT_INF,
    FLAG_RANDOMIZER_INF,
    FLAG_GS_TOKEN,
} FlagType;

typedef struct {
    /* 0x00 */ s32 flagID;     // which flag to set when Player_SetPendingFlag is called
    /* 0x04 */ FlagType flagType;  // type of flag to set when Player_SetPendingFlag is called
} PendingFlag; // size = 0x06
// #endregion

#define PLAYER_STATE1_EXITING_SCENE (1 << 0)
#define PLAYER_STATE1_SWINGING_BOTTLE (1 << 1)
#define PLAYER_STATE1_END_HOOKSHOT_MOVE (1 << 2)
#define PLAYER_STATE1_AIMING_FPS_ITEM (1 << 3)
#define PLAYER_STATE1_Z_TARGETING_UNFRIENDLY (1 << 4)
#define PLAYER_STATE1_INPUT_DISABLED (1 << 5)
#define PLAYER_STATE1_TALKING (1 << 6)
#define PLAYER_STATE1_IN_DEATH_CUTSCENE (1 << 7)
#define PLAYER_STATE1_START_CHANGE_ITEM (1 << 8)
#define PLAYER_STATE1_READY_TO_SHOOT (1 << 9)
#define PLAYER_STATE1_GETTING_ITEM (1 << 10)
#define PLAYER_STATE1_HOLDING_ACTOR (1 << 11)
#define PLAYER_STATE1_CHARGING_SPIN_ATTACK (1 << 12)
#define PLAYER_STATE1_HANGING_FROM_LEDGE_SLIP (1 << 13)
#define PLAYER_STATE1_CLIMBING_ONTO_LEDGE (1 << 14)
#define PLAYER_STATE1_UNUSED_Z_TARGETING_FLAG (1 << 15)
#define PLAYER_STATE1_FORCE_STRAFING (1 << 16)
#define PLAYER_STATE1_Z_TARGETING_FRIENDLY (1 << 17)
#define PLAYER_STATE1_JUMPING (1 << 18)
#define PLAYER_STATE1_FREEFALLING (1 << 19)
#define PLAYER_STATE1_IN_FIRST_PERSON_MODE (1 << 20)
#define PLAYER_STATE1_CLIMBING (1 << 21)
#define PLAYER_STATE1_SHIELDING (1 << 22)
#define PLAYER_STATE1_RIDING_HORSE (1 << 23)
#define PLAYER_STATE1_AIMING_BOOMERANG (1 << 24)
#define PLAYER_STATE1_AWAITING_THROWN_BOOMERANG (1 << 25)
#define PLAYER_STATE1_TAKING_DAMAGE (1 << 26)
#define PLAYER_STATE1_SWIMMING (1 << 27)
#define PLAYER_STATE1_SKIP_OTHER_ACTORS_UPDATE (1 << 28)
#define PLAYER_STATE1_IN_CUTSCENE (1 << 29)
#define PLAYER_STATE1_30 (1 << 30)
#define PLAYER_STATE1_FALLING_INTO_GROTTO_OR_VOID (1 << 31)

#define PLAYER_STATE2_CAN_GRAB_PUSH_PULL_WALL (1 << 0)
#define PLAYER_STATE2_CAN_SPEAK_OR_CHECK (1 << 1)
#define PLAYER_STATE2_CAN_CLIMB_PUSH_PULL_WALL (1 << 2)
#define PLAYER_STATE2_MAKING_REACTABLE_NOISE (1 << 3)
#define PLAYER_STATE2_MOVING_PUSH_PULL_WALL (1 << 4)
#define PLAYER_STATE2_DISABLE_MOVE_ROTATION_WHILE_Z_TARGETING (1 << 5)
#define PLAYER_STATE2_ALWAYS_DISABLE_MOVE_ROTATION (1 << 6)
#define PLAYER_STATE2_RESTRAINED_BY_ENEMY (1 << 7)
#define PLAYER_STATE2_ENABLE_PUSH_PULL_CAM (1 << 8)
#define PLAYER_STATE2_SPAWN_DUST_AT_FEET (1 << 9)
#define PLAYER_STATE2_DIVING (1 << 10)
#define PLAYER_STATE2_ENABLE_DIVE_CAMERA_AND_TIMER (1 << 11)
#define PLAYER_STATE2_IDLE_WHILE_CLIMBING (1 << 12)
#define PLAYER_STATE2_USING_SWITCH_Z_TARGETING (1 << 13)
#define PLAYER_STATE2_FROZEN_IN_ICE (1 << 14)
#define PLAYER_STATE2_PAUSE_MOST_UPDATING (1 << 15)
#define PLAYER_STATE2_CAN_ENTER_CRAWLSPACE (1 << 16) // Turns on the "Enter On A" DoAction
#define PLAYER_STATE2_RELEASING_SPIN_ATTACK (1 << 17)
#define PLAYER_STATE2_INSIDE_CRAWLSPACE (1 << 18) // Crawling through a crawlspace
#define PLAYER_STATE2_BACKFLIPPING_OR_SIDEHOPPING (1 << 19)
#define PLAYER_STATE2_NAVI_IS_ACTIVE (1 << 20)
#define PLAYER_STATE2_NAVI_REQUESTING_TALK (1 << 21)
#define PLAYER_STATE2_CAN_DISMOUNT_HORSE (1 << 22)
#define PLAYER_STATE2_NEAR_OCARINA_ACTOR (1 << 23)
#define PLAYER_STATE2_ATTEMPT_PLAY_OCARINA_FOR_ACTOR (1 << 24)
#define PLAYER_STATE2_PLAYING_OCARINA_FOR_ACTOR (1 << 25)
#define PLAYER_STATE2_ENABLE_REFLECTION (1 << 26)
#define PLAYER_STATE2_PLAYING_OCARINA_GENERAL (1 << 27)
#define PLAYER_STATE2_IDLING (1 << 28)
#define PLAYER_STATE2_DISABLE_DRAW (1 << 29)
#define PLAYER_STATE2_ENABLE_FORWARD_SLIDE_FROM_ATTACK (1 << 30)
#define PLAYER_STATE2_FORCE_VOID_OUT (1 << 31)

#define PLAYER_STATE3_IGNORE_CEILING_FLOOR_AND_WATER (1 << 0)
#define PLAYER_STATE3_MIDAIR (1 << 1)
#define PLAYER_STATE3_PAUSE_ACTION_FUNC (1 << 2)
#define PLAYER_STATE3_ENDING_MELEE_ATTACK (1 << 3)
#define PLAYER_STATE3_CHECKING_FLOOR_AND_WATER_COLLISION (1 << 4)
#define PLAYER_STATE3_FORCE_PULL_OCARINA (1 << 5)
#define PLAYER_STATE3_RESTORE_NAYRUS_LOVE (1 << 6) // Set by ocarina effects actors when destroyed to signal Nayru's Love may be restored (see `ACTOROVL_ALLOC_ABSOLUTE`)
#define PLAYER_STATE3_MOVING_ALONG_HOOKSHOT_PATH (1 << 7)

typedef void (*PlayerActionFunc)(struct Player*, struct PlayState*);
typedef s32(*PlayerUpperActionFunc)(struct Player*, struct PlayState*);
typedef void (*PlayerMiniCsFunc)(struct PlayState*, struct Player*);

typedef struct Player {
    /* 0x0000 */ Actor      actor;
    /* 0x014C */ s8         currentTunic; // current tunic from `PlayerTunic`
    /* 0x014D */ s8         currentSwordItemId;
    /* 0x014E */ s8         currentShield; // current shield from `PlayerShield`
    /* 0x014F */ s8         currentBoots; // current boots from `PlayerBoots`
    /* 0x0150 */ s8         heldItemButton; // Button index for the item currently used
    /* 0x0151 */ s8         heldItemAction; // Item action for the item currently used
    /* 0x0152 */ u8         heldItemId; // Item id for the item currently used
    /* 0x0153 */ s8         prevBoots; // previous boots from `PlayerBoots`
    /* 0x0154 */ s8         itemAction; // the difference between this and heldItemAction is unclear
    /* 0x0155 */ char       unk_155[0x003];
    /* 0x0158 */ u8         modelGroup;
    /* 0x0159 */ u8         nextModelGroup;
    /* 0x015A */ s8         itemChangeAnim;
    /* 0x015B */ u8         modelAnimType;
    /* 0x015C */ u8         leftHandType;
    /* 0x015D */ u8         rightHandType;
    /* 0x015E */ u8         sheathType;
    /* 0x015F */ u8         currentMask; // current mask equipped from `PlayerMask`
    /* 0x0160 */ Gfx**      rightHandDLists;
    /* 0x0164 */ Gfx**      leftHandDLists;
    /* 0x0168 */ Gfx**      sheathDLists;
    /* 0x016C */ Gfx**      waistDLists;
    /* 0x0170 */ u8         giObjectLoading;
    /* 0x0174 */ DmaRequest giObjectDmaRequest;
    /* 0x0194 */ OSMesgQueue giObjectLoadQueue;
    /* 0x01AC */ OSMesg     giObjectLoadMsg;
    /* 0x01B0 */ void*      giObjectSegment; // also used for title card textures
    /* 0x01B4 */ SkelAnime  skelAnime;
    /* 0x01F8 */ Vec3s      jointTable[PLAYER_LIMB_BUF_COUNT];
    /* 0x0288 */ Vec3s      morphTable[PLAYER_LIMB_BUF_COUNT];
    /* 0x0318 */ Vec3s      blendTable[PLAYER_LIMB_BUF_COUNT];
    /* 0x03A8 */ s16        unk_3A8[2];
    /* 0x03AC */ Actor*     heldActor;
    /* 0x03B0 */ Vec3f      leftHandPos;
    /* 0x03BC */ Vec3s      leftHandRot;
    /* 0x03C4 */ Actor*     pushPullActor;
    /* 0x03C8 */ Vec3f      hookshotHeldPos;
    /* 0x03D4 */ char       unk_3D4[0x058];
    /* 0x042C */ s8         doorType;
    /* 0x042D */ s8         doorDirection;
    /* 0x042E */ s16        doorTimer;
    /* 0x0430 */ Actor*     doorActor;
    /* 0x0434 */ s16        getItemId; // Upstream TODO: Document why this is s16 while it's s8 upstream
    /* 0x0436 */ u16        getItemDirection;
    /* 0x0438 */ Actor*     interactRangeActor;
    /* 0x043C */ s8         mountSide;
    /* 0x043D */ char       unk_43D[0x003];
    /* 0x0440 */ Actor*     rideActor;
    /* 0x0444 */ u8         csMode;
    /* 0x0445 */ u8         prevCsMode;
    /* 0x0446 */ u8         csAction;
    /* 0x0447 */ u8         csDoorType;
    /* 0x0448 */ Actor*     csTargetActor;
    /* 0x044C */ char       unk_44C[0x004];
    /* 0x0450 */ Vec3f      csStartPos;
    /* 0x045C */ Vec3f      csEndPos;
    /* 0x0468 */ char       unk_468[0x002];
    /* 0x046A */ s16        doorBgCamIndex;
    /* 0x046C */ s16        subCamId;
    /* 0x046E */ char       unk_46E[0x02A];
    /* 0x0498 */ ColliderCylinder cylinder;
    /* 0x04E4 */ ColliderQuad meleeWeaponQuads[2];
    /* 0x05E4 */ ColliderQuad shieldQuad;
    /* 0x0664 */ Actor*     targetActor;
    /* 0x0668 */ char       unk_668[0x004];
    /* 0x066C */ s32        targetSwitchTimer;
    /* 0x0670 */ s32        meleeWeaponEffectIndex;
    /* 0x0674 */ PlayerActionFunc actionFunc;
    /* 0x0678 */ PlayerAgeProperties* ageProperties;
    /* 0x067C */ u32        stateFlags1;
    /* 0x0680 */ u32        stateFlags2;
    /* 0x0684 */ Actor*     forcedTargetActor;
    /* 0x0688 */ Actor*     boomerangActor;
    /* 0x068C */ Actor*     naviActor;
    /* 0x0690 */ s16        naviTextId;
    /* 0x0692 */ u8         stateFlags3;
    /* 0x0693 */ s8         exchangeItemId;
    /* 0x0694 */ Actor*     talkActor;
    /* 0x0698 */ f32        talkActorDistance;
    /* 0x069C */ char       unk_69C[0x004];
    /* 0x06A0 */ f32        stoneOfAgonyRumbleTimer;
    /* 0x06A4 */ f32        stoneOfAgonyActorDistSq;
    /* 0x06A8 */ Actor*     ocarinaActor;
    /* 0x06AC */ s8         idleCounter;
    /* 0x06AD */ u8         attentionMode;
    /* 0x06AE */ u16        lookFlags;
    /* 0x06B0 */ s16        upperBodyYawOffset;
    /* 0x06B2 */ char       unk_6B4[0x004];
    /* 0x06B6 */ Vec3s      headRot;
    /* 0x06BC */ Vec3s      upperBodyRot;
    /* 0x06C2 */ s16        shapePitchOffset;
    /* 0x06C4 */ f32        shapeOffsetY;
    /* 0x06C8 */ SkelAnime  skelAnimeUpper;
    /* 0x070C */ Vec3s      jointTableUpper[PLAYER_LIMB_BUF_COUNT];
    /* 0x079C */ Vec3s      morphTableUpper[PLAYER_LIMB_BUF_COUNT];
    /* 0x082C */ PlayerUpperActionFunc upperActionFunc;
    /* 0x0830 */ f32        upperInterpWeight;
    /* 0x0834 */ s16        fpsItemTimer;
    /* 0x0836 */ s8         fpsItemShootState;
    /* 0x0837 */ u8         putAwayTimer;
    /* 0x0838 */ f32        linearVelocity;
    /* 0x083C */ s16        currentYaw;
    /* 0x083E */ s16        targetYaw;
    /* 0x0840 */ u16        unk_840;
    /* 0x0842 */ s8         meleeWeaponAnimation;
    /* 0x0843 */ s8         meleeWeaponState;
    /* 0x0844 */ s8         comboTimer;
    /* 0x0845 */ u8         slashCounter;
    /* 0x0846 */ u8         inputFrameCounter;
    /* 0x0847 */ s8         analogStickInputs[4];
    /* 0x084B */ s8         relativeAnalogStickInputs[4];
    /* 0x084F */ s8         genericVar;
    /* 0x0850 */ s16        genericTimer; // multipurpose timer
    /* 0x0854 */ f32        rippleTimer;
    /* 0x0858 */ f32        unk_858;
    /* 0x085C */ f32        unk_85C; // stick length among other things
    /* 0x0860 */ s16        fpsItemType; // stick flame timer among other things
    /* 0x0862 */ s16        giDrawIdPlusOne; // get item draw ID + 1
    /* 0x0864 */ f32        unk_864;
    /* 0x0868 */ f32        walkFrame;
    /* 0x086C */ f32        unk_86C;
    /* 0x0870 */ f32        leftRightBlendWeight; // Represents blend weight between left (1.0f) and right (0.0f) for some anims
    /* 0x0874 */ f32        leftRightBlendWeightTarget;
    /* 0x0878 */ f32        rideOffsetY;
    /* 0x087C */ s16        unk_87C;
    /* 0x087E */ s16        unk_87E;
    /* 0x0880 */ f32        speedLimit;
    /* 0x0884 */ f32        wallHeight; // height used to determine whether link can climb or grab a ledge at the top
    /* 0x0888 */ f32        wallDistance; // distance to the colliding wall plane
    /* 0x088C */ u8         touchedWallJumpType;
    /* 0x088D */ u8         wallTouchTimer;
    /* 0x088E */ u8         endTalkTimer;
    /* 0x088F */ u8         damageFlashTimer;
    /* 0x0890 */ u8         runDamageTimer;
    /* 0x0891 */ u8         shockTimer;
    /* 0x0892 */ u8         unk_892;
    /* 0x0893 */ u8         hoverBootsTimer;
    /* 0x0894 */ s16        fallStartHeight; // last truncated Y position before falling
    /* 0x0896 */ s16        fallDistance; // truncated Y distance the player has fallen so far (positive is down)
    /* 0x0898 */ s16        angleToFloorX;
    /* 0x089A */ s16        angleToFloorY;
    /* 0x089C */ s16        walkAngleToFloorX;
    /* 0x089E */ u16        surfaceMaterial;
    /* 0x08A0 */ u8         damageAmount;
    /* 0x08A1 */ u8         damageEffect;
    /* 0x08A2 */ s16        damageYaw;
    /* 0x08A4 */ f32        knockbackVelXZ;
    /* 0x08A8 */ f32        knockbackVelY;
    /* 0x08AC */ f32        pushedSpeed; // Pushing player, examples include water currents, floor conveyors, climbing sloped surfaces
    /* 0x08B0 */ s16        pushedYaw; // Yaw direction of player being pushed
    /* 0x08B4 */ WeaponInfo meleeWeaponInfo[3];
    /* 0x0908 */ Vec3f      bodyPartsPos[PLAYER_BODYPART_MAX];
    /* 0x09E0 */ MtxF       mf_9E0;
    /* 0x0A20 */ MtxF       shieldMf;
    /* 0x0A60 */ u8         isBurning;
    /* 0x0A61 */ u8         flameTimers[PLAYER_BODYPART_MAX]; // one flame per body part
    /* 0x0A73 */ u8         fpsItemShotTimer;
    /* 0x0A74 */ PlayerMiniCsFunc miniCsFunc;
    /* 0x0A78 */ s8         invincibilityTimer; // prevents damage when nonzero (positive = visible, counts towards zero each frame)
    /* 0x0A79 */ u8         hurtFloorTimer;
    /* 0x0A7A */ u8         floorProperty;
    /* 0x0A7B */ u8         prevFloorSpecialProperty;
    /* 0x0A7C */ f32        analogStickDistance;
    /* 0x0A80 */ s16        analogStickAngle;
    /* 0x0A82 */ u16        prevSurfaceMaterial;
    /* 0x0A84 */ s16        sceneExitPosY;
    /* 0x0A86 */ s8         voidRespawnCounter;
    /* 0x0A87 */ u8         deathTimer;
    /* 0x0A88 */ Vec3f      prevWaistPos; // previous body part 0 position
    // #region SOH [General]
    // Upstream TODO: Rename these to be more obviously SoH specific
    /*        */ PendingFlag pendingFlag;
    /*        */ GetItemEntry getItemEntry;
    // #endregion
    // #region SOH [Enhancements]
    // Upstream TODO: Rename this to make it more obvious it is apart of an enhancement
    /*        */ u8         boomerangQuickRecall; // Has the player pressed the boomerang button while it's in the air still?
    // #endregion
    u8 ivanFloating;
    u8 ivanDamageMultiplier;
} Player; // size = 0xA94

#endif
